{"format": "graph-model", "generatedBy": "2.9.0", "convertedBy": "TensorFlow.js Converter v3.17.0", "signature": {"inputs": {"MNET_INPUT": {"name": "MNET_INPUT:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "3"}]}}}, "outputs": {"Identity": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "6522"}]}}}}, "modelTopology": {"node": [{"name": "BirdNET/MNET_CONVERT/strided_slice/begin", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "BirdNET/MNET_CONVERT/strided_slice/end", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "BirdNET/MNET_CONVERT/strided_slice/strides", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "BirdNET/MNET_CONVERT/add/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "BirdNET/MNET_CONVERT/truediv_BirdNET/MNET_CONVERT/add_2/y1/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "BirdNET/MNET_CONVERT/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "BirdNET/MNET_CONVERT/mul_1/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "BirdNET/MNET_CONVERT/add_1/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "BirdNET/MNET_CONVERT/mul_2/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "BirdNET/MNET_CONVERT/strided_slice_1/begin", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "BirdNET/MNET_CONVERT/strided_slice_1/end", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "BirdNET/MNET_CONVERT/strided_slice_1/strides", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "BirdNET/MNET_CONVERT/add_2/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "BirdNET/MNET_CONVERT/truediv_2_BirdNET/MNET_CONVERT/truediv_2/y1/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "BirdNET/MNET_CONVERT/ExpandDims_1/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "BirdNET/MNET_CONVERT/mul_4/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "BirdNET/MNET_CONVERT/add_3/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "BirdNET/MNET_CONVERT/mul_5/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "BirdNET/MNET_CONVERT/sub/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "BirdNET/MNET_CONVERT/truediv_4_BirdNET/MNET_CONVERT/range/limit1/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "BirdNET/MNET_CONVERT/ExpandDims_2/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "BirdNET/MNET_CONVERT/mul_7/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "BirdNET/MNET_CONVERT/add_4/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}}}, {"name": "BirdNET/MNET_CONVERT/mul_8/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "BirdNET/MNET_CONVERT/Greater/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "BirdNET/MNET_CONVERT/SelectV2/t", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "BirdNET/MNET_CONVERT/SelectV2/e", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "BirdNET/MNET_CONVERT/strided_slice_2/begin", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "BirdNET/MNET_CONVERT/strided_slice_2/end", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "BirdNET/MNET_CONVERT/strided_slice_2/strides", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "BirdNET/MNET_CONVERT/Less/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "BirdNET/MNET_CONVERT/SelectV2_1/t", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "BirdNET/MNET_CONVERT/SelectV2_1/e", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "BirdNET/MNET_CONVERT/ExpandDims_3/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "BirdNET/MNET_CONVERT/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "BirdNET/MNET_BLOCK_1_DENSE_1/MatMul_BirdNET/MNET_BLOCK_1_DENSE_1/BiasAdd_BirdNET/MNET_BLOCK_1_DENSE_1/Relu_dense/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "144"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "BirdNET/MNET_BLOCK_1_DENSE_1/MatMul_BirdNET/MNET_BLOCK_1_DENSE_1/BiasAdd_BirdNET/MNET_BLOCK_1_DENSE_1/Relu_dense/bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "BirdNET/MNET_BLOCK_2_DENSE_1/MatMul_BirdNET/MNET_BLOCK_2_DENSE_1/BiasAdd_BirdNET/MNET_BLOCK_2_DENSE_1/Relu_dense/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "BirdNET/MNET_BLOCK_2_DENSE_1/MatMul_BirdNET/MNET_BLOCK_2_DENSE_1/BiasAdd_BirdNET/MNET_BLOCK_2_DENSE_1/Relu_dense/bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}}, {"name": "BirdNET/MNET_BLOCK_3_DENSE_1/MatMul_BirdNET/MNET_BLOCK_3_DENSE_1/BiasAdd_BirdNET/MNET_BLOCK_3_DENSE_1/Relu_dense/kernel", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "512"}]}}}}}, {"name": "BirdNET/MNET_BLOCK_3_DENSE_1/MatMul_BirdNET/MNET_BLOCK_3_DENSE_1/BiasAdd_BirdNET/MNET_BLOCK_3_DENSE_1/Relu_dense/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "BirdNET/MNET_CLASS_ACTIVATIONS/MatMul_BirdNET/MNET_CLASS_ACTIVATIONS/BiasAdd_dense/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "6522"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "BirdNET/MNET_CLASS_ACTIVATIONS/MatMul_BirdNET/MNET_CLASS_ACTIVATIONS/BiasAdd_dense/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "6522"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "BirdNET/MNET_CLASS_ACTIVATION/clip_by_value/Minimum/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "BirdNET/MNET_CLASS_ACTIVATION/clip_by_value/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "BirdNET/MNET_CLASS_ACTIVATION/mul/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "BirdNET/MNET_CLASS_ACTIVATION/add/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MNET_INPUT", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "1"}, {"size": "3"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "BirdNET/MNET_CONVERT/strided_slice", "op": "StridedSlice", "input": ["MNET_INPUT", "BirdNET/MNET_CONVERT/strided_slice/begin", "BirdNET/MNET_CONVERT/strided_slice/end", "BirdNET/MNET_CONVERT/strided_slice/strides"], "attr": {"T": {"type": "DT_FLOAT"}, "end_mask": {"i": "1"}, "shrink_axis_mask": {"i": "2"}, "ellipsis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}}}, {"name": "BirdNET/MNET_CONVERT/strided_slice_1", "op": "StridedSlice", "input": ["MNET_INPUT", "BirdNET/MNET_CONVERT/strided_slice_1/begin", "BirdNET/MNET_CONVERT/strided_slice_1/end", "BirdNET/MNET_CONVERT/strided_slice_1/strides"], "attr": {"ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "end_mask": {"i": "1"}, "shrink_axis_mask": {"i": "2"}}}, {"name": "BirdNET/MNET_CONVERT/strided_slice_2", "op": "StridedSlice", "input": ["MNET_INPUT", "BirdNET/MNET_CONVERT/strided_slice_2/begin", "BirdNET/MNET_CONVERT/strided_slice_2/end", "BirdNET/MNET_CONVERT/strided_slice_2/strides"], "attr": {"ellipsis_mask": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}, "end_mask": {"i": "1"}, "shrink_axis_mask": {"i": "2"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "1"}}}, {"name": "BirdNET/MNET_CONVERT/add", "op": "AddV2", "input": ["BirdNET/MNET_CONVERT/strided_slice", "BirdNET/MNET_CONVERT/add/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "BirdNET/MNET_CONVERT/add_2", "op": "AddV2", "input": ["BirdNET/MNET_CONVERT/strided_slice_1", "BirdNET/MNET_CONVERT/add_2/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "BirdNET/MNET_CONVERT/sub", "op": "Sub", "input": ["BirdNET/MNET_CONVERT/strided_slice_2", "BirdNET/MNET_CONVERT/sub/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "BirdNET/MNET_CONVERT/Greater", "op": "Greater", "input": ["BirdNET/MNET_CONVERT/strided_slice_2", "BirdNET/MNET_CONVERT/Greater/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "BirdNET/MNET_CONVERT/Less", "op": "Less", "input": ["BirdNET/MNET_CONVERT/strided_slice_2", "BirdNET/MNET_CONVERT/Less/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "BirdNET/MNET_CONVERT/truediv_BirdNET/MNET_CONVERT/add_2/y1", "op": "Mul", "input": ["BirdNET/MNET_CONVERT/add", "BirdNET/MNET_CONVERT/truediv_BirdNET/MNET_CONVERT/add_2/y1/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "BirdNET/MNET_CONVERT/truediv_2_BirdNET/MNET_CONVERT/truediv_2/y1", "op": "Mul", "input": ["BirdNET/MNET_CONVERT/add_2", "BirdNET/MNET_CONVERT/truediv_2_BirdNET/MNET_CONVERT/truediv_2/y1/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "BirdNET/MNET_CONVERT/truediv_4_BirdNET/MNET_CONVERT/range/limit1", "op": "Mul", "input": ["BirdNET/MNET_CONVERT/sub", "BirdNET/MNET_CONVERT/truediv_4_BirdNET/MNET_CONVERT/range/limit1/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "BirdNET/MNET_CONVERT/SelectV2", "op": "SelectV2", "input": ["BirdNET/MNET_CONVERT/Greater", "BirdNET/MNET_CONVERT/SelectV2/t", "BirdNET/MNET_CONVERT/SelectV2/e"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "BirdNET/MNET_CONVERT/SelectV2_1", "op": "SelectV2", "input": ["BirdNET/MNET_CONVERT/Less", "BirdNET/MNET_CONVERT/SelectV2_1/t", "BirdNET/MNET_CONVERT/SelectV2_1/e"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "BirdNET/MNET_CONVERT/ExpandDims", "op": "ExpandDims", "input": ["BirdNET/MNET_CONVERT/truediv_BirdNET/MNET_CONVERT/add_2/y1", "BirdNET/MNET_CONVERT/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "BirdNET/MNET_CONVERT/ExpandDims_1", "op": "ExpandDims", "input": ["BirdNET/MNET_CONVERT/truediv_2_BirdNET/MNET_CONVERT/truediv_2/y1", "BirdNET/MNET_CONVERT/ExpandDims_1/dim"], "attr": {"T": {"type": "DT_FLOAT"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "BirdNET/MNET_CONVERT/ExpandDims_2", "op": "ExpandDims", "input": ["BirdNET/MNET_CONVERT/truediv_4_BirdNET/MNET_CONVERT/range/limit1", "BirdNET/MNET_CONVERT/ExpandDims_2/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "BirdNET/MNET_CONVERT/mul_9", "op": "Mul", "input": ["BirdNET/MNET_CONVERT/SelectV2", "BirdNET/MNET_CONVERT/SelectV2_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "BirdNET/MNET_CONVERT/mul_1", "op": "Mul", "input": ["BirdNET/MNET_CONVERT/ExpandDims", "BirdNET/MNET_CONVERT/mul_1/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "BirdNET/MNET_CONVERT/mul_4", "op": "Mul", "input": ["BirdNET/MNET_CONVERT/ExpandDims_1", "BirdNET/MNET_CONVERT/mul_4/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "BirdNET/MNET_CONVERT/mul_7", "op": "Mul", "input": ["BirdNET/MNET_CONVERT/ExpandDims_2", "BirdNET/MNET_CONVERT/mul_7/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "BirdNET/MNET_CONVERT/ExpandDims_3", "op": "ExpandDims", "input": ["BirdNET/MNET_CONVERT/mul_9", "BirdNET/MNET_CONVERT/ExpandDims_3/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "BirdNET/MNET_CONVERT/add_1", "op": "AddV2", "input": ["BirdNET/MNET_CONVERT/mul_1", "BirdNET/MNET_CONVERT/add_1/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "BirdNET/MNET_CONVERT/add_3", "op": "AddV2", "input": ["BirdNET/MNET_CONVERT/mul_4", "BirdNET/MNET_CONVERT/add_3/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "BirdNET/MNET_CONVERT/add_4", "op": "AddV2", "input": ["BirdNET/MNET_CONVERT/mul_7", "BirdNET/MNET_CONVERT/add_4/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "BirdNET/MNET_CONVERT/Sin", "op": "Sin", "input": ["BirdNET/MNET_CONVERT/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "BirdNET/MNET_CONVERT/Sin_1", "op": "Sin", "input": ["BirdNET/MNET_CONVERT/add_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "BirdNET/MNET_CONVERT/Sin_2", "op": "Sin", "input": ["BirdNET/MNET_CONVERT/add_4"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "BirdNET/MNET_CONVERT/mul_2", "op": "Mul", "input": ["BirdNET/MNET_CONVERT/Sin", "BirdNET/MNET_CONVERT/mul_2/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "BirdNET/MNET_CONVERT/mul_5", "op": "Mul", "input": ["BirdNET/MNET_CONVERT/Sin_1", "BirdNET/MNET_CONVERT/mul_5/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "BirdNET/MNET_CONVERT/mul_8", "op": "Mul", "input": ["BirdNET/MNET_CONVERT/Sin_2", "BirdNET/MNET_CONVERT/mul_8/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "BirdNET/MNET_CONVERT/Mul_10", "op": "Mul", "input": ["BirdNET/MNET_CONVERT/mul_8", "BirdNET/MNET_CONVERT/ExpandDims_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "BirdNET/MNET_CONVERT/concat", "op": "ConcatV2", "input": ["BirdNET/MNET_CONVERT/mul_2", "BirdNET/MNET_CONVERT/mul_5", "BirdNET/MNET_CONVERT/Mul_10", "BirdNET/MNET_CONVERT/concat/axis"], "attr": {"N": {"i": "3"}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "BirdNET/MNET_BLOCK_1_DENSE_1/MatMul_BirdNET/MNET_BLOCK_1_DENSE_1/BiasAdd_BirdNET/MNET_BLOCK_1_DENSE_1/Relu_dense/Relu", "op": "_FusedMatMul", "input": ["BirdNET/MNET_CONVERT/concat", "BirdNET/MNET_BLOCK_1_DENSE_1/MatMul_BirdNET/MNET_BLOCK_1_DENSE_1/BiasAdd_BirdNET/MNET_BLOCK_1_DENSE_1/Relu_dense/kernel", "BirdNET/MNET_BLOCK_1_DENSE_1/MatMul_BirdNET/MNET_BLOCK_1_DENSE_1/BiasAdd_BirdNET/MNET_BLOCK_1_DENSE_1/Relu_dense/bias"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}, "epsilon": {"f": 0.0}, "transpose_a": {"b": false}}}, {"name": "BirdNET/MNET_BLOCK_2_DENSE_1/MatMul_BirdNET/MNET_BLOCK_2_DENSE_1/BiasAdd_BirdNET/MNET_BLOCK_2_DENSE_1/Relu_dense/Relu", "op": "_FusedMatMul", "input": ["BirdNET/MNET_BLOCK_1_DENSE_1/MatMul_BirdNET/MNET_BLOCK_1_DENSE_1/BiasAdd_BirdNET/MNET_BLOCK_1_DENSE_1/Relu_dense/Relu", "BirdNET/MNET_BLOCK_2_DENSE_1/MatMul_BirdNET/MNET_BLOCK_2_DENSE_1/BiasAdd_BirdNET/MNET_BLOCK_2_DENSE_1/Relu_dense/kernel", "BirdNET/MNET_BLOCK_2_DENSE_1/MatMul_BirdNET/MNET_BLOCK_2_DENSE_1/BiasAdd_BirdNET/MNET_BLOCK_2_DENSE_1/Relu_dense/bias"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "transpose_a": {"b": false}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "BirdNET/MNET_BLOCK_3_DENSE_1/MatMul_BirdNET/MNET_BLOCK_3_DENSE_1/BiasAdd_BirdNET/MNET_BLOCK_3_DENSE_1/Relu_dense/Relu", "op": "_FusedMatMul", "input": ["BirdNET/MNET_BLOCK_2_DENSE_1/MatMul_BirdNET/MNET_BLOCK_2_DENSE_1/BiasAdd_BirdNET/MNET_BLOCK_2_DENSE_1/Relu_dense/Relu", "BirdNET/MNET_BLOCK_3_DENSE_1/MatMul_BirdNET/MNET_BLOCK_3_DENSE_1/BiasAdd_BirdNET/MNET_BLOCK_3_DENSE_1/Relu_dense/kernel", "BirdNET/MNET_BLOCK_3_DENSE_1/MatMul_BirdNET/MNET_BLOCK_3_DENSE_1/BiasAdd_BirdNET/MNET_BLOCK_3_DENSE_1/Relu_dense/bias"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "transpose_b": {"b": false}, "transpose_a": {"b": false}}}, {"name": "BirdNET/MNET_CLASS_ACTIVATIONS/MatMul_BirdNET/MNET_CLASS_ACTIVATIONS/BiasAdd_dense/BiasAdd", "op": "_FusedMatMul", "input": ["BirdNET/MNET_BLOCK_3_DENSE_1/MatMul_BirdNET/MNET_BLOCK_3_DENSE_1/BiasAdd_BirdNET/MNET_BLOCK_3_DENSE_1/Relu_dense/Relu", "BirdNET/MNET_CLASS_ACTIVATIONS/MatMul_BirdNET/MNET_CLASS_ACTIVATIONS/BiasAdd_dense/kernel", "BirdNET/MNET_CLASS_ACTIVATIONS/MatMul_BirdNET/MNET_CLASS_ACTIVATIONS/BiasAdd_dense/bias"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}}}, {"name": "BirdNET/MNET_CLASS_ACTIVATION/clip_by_value/Minimum", "op": "Minimum", "input": ["BirdNET/MNET_CLASS_ACTIVATIONS/MatMul_BirdNET/MNET_CLASS_ACTIVATIONS/BiasAdd_dense/BiasAdd", "BirdNET/MNET_CLASS_ACTIVATION/clip_by_value/Minimum/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "BirdNET/MNET_CLASS_ACTIVATION/clip_by_value", "op": "Maximum", "input": ["BirdNET/MNET_CLASS_ACTIVATION/clip_by_value/Minimum", "BirdNET/MNET_CLASS_ACTIVATION/clip_by_value/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "BirdNET/MNET_CLASS_ACTIVATION/mul", "op": "Mul", "input": ["BirdNET/MNET_CLASS_ACTIVATION/clip_by_value", "BirdNET/MNET_CLASS_ACTIVATION/mul/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "BirdNET/MNET_CLASS_ACTIVATION/Exp", "op": "Exp", "input": ["BirdNET/MNET_CLASS_ACTIVATION/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "BirdNET/MNET_CLASS_ACTIVATION/add", "op": "AddV2", "input": ["BirdNET/MNET_CLASS_ACTIVATION/Exp", "BirdNET/MNET_CLASS_ACTIVATION/add/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Reciprocal", "input": ["BirdNET/MNET_CLASS_ACTIVATION/add"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1087}}, "weightsManifest": [{"paths": ["group1-shard1of2.bin", "group1-shard2of2.bin"], "weights": [{"name": "BirdNET/MNET_CONVERT/strided_slice/begin", "shape": [2], "dtype": "int32"}, {"name": "BirdNET/MNET_CONVERT/strided_slice/end", "shape": [2], "dtype": "int32"}, {"name": "BirdNET/MNET_CONVERT/strided_slice/strides", "shape": [2], "dtype": "int32"}, {"name": "BirdNET/MNET_CONVERT/add/y", "shape": [], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "BirdNET/MNET_CONVERT/truediv_BirdNET/MNET_CONVERT/add_2/y1/y", "shape": [], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "BirdNET/MNET_CONVERT/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "BirdNET/MNET_CONVERT/mul_1/y", "shape": [], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "BirdNET/MNET_CONVERT/add_1/y", "shape": [48], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "BirdNET/MNET_CONVERT/mul_2/y", "shape": [], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "BirdNET/MNET_CONVERT/strided_slice_1/begin", "shape": [2], "dtype": "int32"}, {"name": "BirdNET/MNET_CONVERT/strided_slice_1/end", "shape": [2], "dtype": "int32"}, {"name": "BirdNET/MNET_CONVERT/strided_slice_1/strides", "shape": [2], "dtype": "int32"}, {"name": "BirdNET/MNET_CONVERT/add_2/y", "shape": [], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "BirdNET/MNET_CONVERT/truediv_2_BirdNET/MNET_CONVERT/truediv_2/y1/y", "shape": [], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "BirdNET/MNET_CONVERT/ExpandDims_1/dim", "shape": [], "dtype": "int32"}, {"name": "BirdNET/MNET_CONVERT/mul_4/y", "shape": [], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "BirdNET/MNET_CONVERT/add_3/y", "shape": [48], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "BirdNET/MNET_CONVERT/mul_5/y", "shape": [], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "BirdNET/MNET_CONVERT/sub/y", "shape": [], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "BirdNET/MNET_CONVERT/truediv_4_BirdNET/MNET_CONVERT/range/limit1/y", "shape": [], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "BirdNET/MNET_CONVERT/ExpandDims_2/dim", "shape": [], "dtype": "int32"}, {"name": "BirdNET/MNET_CONVERT/mul_7/y", "shape": [], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "BirdNET/MNET_CONVERT/add_4/y", "shape": [48], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "BirdNET/MNET_CONVERT/mul_8/y", "shape": [], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "BirdNET/MNET_CONVERT/Greater/y", "shape": [], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "BirdNET/MNET_CONVERT/SelectV2/t", "shape": [], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "BirdNET/MNET_CONVERT/SelectV2/e", "shape": [], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "BirdNET/MNET_CONVERT/strided_slice_2/begin", "shape": [2], "dtype": "int32"}, {"name": "BirdNET/MNET_CONVERT/strided_slice_2/end", "shape": [2], "dtype": "int32"}, {"name": "BirdNET/MNET_CONVERT/strided_slice_2/strides", "shape": [2], "dtype": "int32"}, {"name": "BirdNET/MNET_CONVERT/Less/y", "shape": [], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "BirdNET/MNET_CONVERT/SelectV2_1/t", "shape": [], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "BirdNET/MNET_CONVERT/SelectV2_1/e", "shape": [], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "BirdNET/MNET_CONVERT/ExpandDims_3/dim", "shape": [], "dtype": "int32"}, {"name": "BirdNET/MNET_CONVERT/concat/axis", "shape": [], "dtype": "int32"}, {"name": "BirdNET/MNET_BLOCK_1_DENSE_1/MatMul_BirdNET/MNET_BLOCK_1_DENSE_1/BiasAdd_BirdNET/MNET_BLOCK_1_DENSE_1/Relu_dense/kernel", "shape": [144, 128], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "BirdNET/MNET_BLOCK_1_DENSE_1/MatMul_BirdNET/MNET_BLOCK_1_DENSE_1/BiasAdd_BirdNET/MNET_BLOCK_1_DENSE_1/Relu_dense/bias", "shape": [128], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "BirdNET/MNET_BLOCK_2_DENSE_1/MatMul_BirdNET/MNET_BLOCK_2_DENSE_1/BiasAdd_BirdNET/MNET_BLOCK_2_DENSE_1/Relu_dense/kernel", "shape": [128, 256], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "BirdNET/MNET_BLOCK_2_DENSE_1/MatMul_BirdNET/MNET_BLOCK_2_DENSE_1/BiasAdd_BirdNET/MNET_BLOCK_2_DENSE_1/Relu_dense/bias", "shape": [256], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "BirdNET/MNET_BLOCK_3_DENSE_1/MatMul_BirdNET/MNET_BLOCK_3_DENSE_1/BiasAdd_BirdNET/MNET_BLOCK_3_DENSE_1/Relu_dense/kernel", "shape": [256, 512], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "BirdNET/MNET_BLOCK_3_DENSE_1/MatMul_BirdNET/MNET_BLOCK_3_DENSE_1/BiasAdd_BirdNET/MNET_BLOCK_3_DENSE_1/Relu_dense/bias", "shape": [512], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "BirdNET/MNET_CLASS_ACTIVATIONS/MatMul_BirdNET/MNET_CLASS_ACTIVATIONS/BiasAdd_dense/kernel", "shape": [512, 6522], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "BirdNET/MNET_CLASS_ACTIVATIONS/MatMul_BirdNET/MNET_CLASS_ACTIVATIONS/BiasAdd_dense/bias", "shape": [6522], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "BirdNET/MNET_CLASS_ACTIVATION/clip_by_value/Minimum/y", "shape": [], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "BirdNET/MNET_CLASS_ACTIVATION/clip_by_value/y", "shape": [], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "BirdNET/MNET_CLASS_ACTIVATION/mul/y", "shape": [], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "BirdNET/MNET_CLASS_ACTIVATION/add/y", "shape": [], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}]}]}